GopalSaraf/Practicals/PSDL/include/proc/pic18f46k40.h
extern volatile WPUDbits_t WPUDbits __at(0xF25);
// bitfield macros
#define _WPUD_WPUD0_POSN                                    0x0
#define _WPUD_WPUD0_POSITION                                0x0
#define _WPUD_WPUD0_SIZE                                    0x1
#define _WPUD_WPUD0_LENGTH                                  0x1
#define _WPUD_WPUD0_MASK                                    0x1
#define _WPUD_WPUD1_POSN                                    0x1
#define _WPUD_WPUD1_POSITION                                0x1
#define _WPUD_WPUD1_SIZE                                    0x1
#define _WPUD_WPUD1_LENGTH                                  0x1
#define _WPUD_WPUD1_MASK                                    0x2
#define _WPUD_WPUD2_POSN                                    0x2
#define _WPUD_WPUD2_POSITION                                0x2
#define _WPUD_WPUD2_SIZE                                    0x1
#define _WPUD_WPUD2_LENGTH                                  0x1
#define _WPUD_WPUD2_MASK                                    0x4
#define _WPUD_WPUD3_POSN                                    0x3
#define _WPUD_WPUD3_POSITION                                0x3
#define _WPUD_WPUD3_SIZE                                    0x1
#define _WPUD_WPUD3_LENGTH                                  0x1
#define _WPUD_WPUD3_MASK                                    0x8
#define _WPUD_WPUD4_POSN                                    0x4
#define _WPUD_WPUD4_POSITION                                0x4
#define _WPUD_WPUD4_SIZE                                    0x1
#define _WPUD_WPUD4_LENGTH                                  0x1
#define _WPUD_WPUD4_MASK                                    0x10
#define _WPUD_WPUD5_POSN                                    0x5
#define _WPUD_WPUD5_POSITION                                0x5
#define _WPUD_WPUD5_SIZE                                    0x1
#define _WPUD_WPUD5_LENGTH                                  0x1
#define _WPUD_WPUD5_MASK                                    0x20
#define _WPUD_WPUD6_POSN                                    0x6
#define _WPUD_WPUD6_POSITION                                0x6
#define _WPUD_WPUD6_SIZE                                    0x1
#define _WPUD_WPUD6_LENGTH                                  0x1
#define _WPUD_WPUD6_MASK                                    0x40
#define _WPUD_WPUD7_POSN                                    0x7
#define _WPUD_WPUD7_POSITION                                0x7
#define _WPUD_WPUD7_SIZE                                    0x1
#define _WPUD_WPUD7_LENGTH                                  0x1
#define _WPUD_WPUD7_MASK                                    0x80

// Register: ANSELD
#define ANSELD ANSELD
extern volatile unsigned char           ANSELD              __at(0xF26);
#ifndef _LIB_BUILD
asm("ANSELD equ 0F26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELD0                :1;
        unsigned ANSELD1                :1;
        unsigned ANSELD2                :1;
        unsigned ANSELD3                :1;
        unsigned ANSELD4                :1;
        unsigned ANSELD5                :1;
        unsigned ANSELD6                :1;
        unsigned ANSELD7                :1;
    };
} ANSELDbits_t;
extern volatile ANSELDbits_t ANSELDbits __at(0xF26);
// bitfield macros
#define _ANSELD_ANSELD0_POSN                                0x0
#define _ANSELD_ANSELD0_POSITION                            0x0
#define _ANSELD_ANSELD0_SIZE                                0x1
#define _ANSELD_ANSELD0_LENGTH                              0x1
#define _ANSELD_ANSELD0_MASK                                0x1
#define _ANSELD_ANSELD1_POSN                                0x1
#define _ANSELD_ANSELD1_POSITION                            0x1
#define _ANSELD_ANSELD1_SIZE                                0x1
#define _ANSELD_ANSELD1_LENGTH                              0x1
#define _ANSELD_ANSELD1_MASK                                0x2
#define _ANSELD_ANSELD2_POSN                                0x2
#define _ANSELD_ANSELD2_POSITION                            0x2
#define _ANSELD_ANSELD2_SIZE                                0x1
#define _ANSELD_ANSELD2_LENGTH                              0x1
#define _ANSELD_ANSELD2_MASK                                0x4
#define _ANSELD_ANSELD3_POSN                                0x3
#define _ANSELD_ANSELD3_POSITION                            0x3
#define _ANSELD_ANSELD3_SIZE                                0x1
#define _ANSELD_ANSELD3_LENGTH                              0x1
#define _ANSELD_ANSELD3_MASK                                0x8
#define _ANSELD_ANSELD4_POSN                                0x4
#define _ANSELD_ANSELD4_POSITION                            0x4
#define _ANSELD_ANSELD4_SIZE                                0x1
#define _ANSELD_ANSELD4_LENGTH                              0x1
#define _ANSELD_ANSELD4_MASK                                0x10
#define _ANSELD_ANSELD5_POSN                                0x5
#define _ANSELD_ANSELD5_POSITION                            0x5
#define _ANSELD_ANSELD5_SIZE                                0x1
#define _ANSELD_ANSELD5_LENGTH                              0x1
#define _ANSELD_ANSELD5_MASK                                0x20
#define _ANSELD_ANSELD6_POSN                                0x6
#define _ANSELD_ANSELD6_POSITION                            0x6
#define _ANSELD_ANSELD6_SIZE                                0x1
#define _ANSELD_ANSELD6_LENGTH                              0x1
#define _ANSELD_ANSELD6_MASK                                0x40
#define _ANSELD_ANSELD7_POSN                                0x7
#define _ANSELD_ANSELD7_POSITION                            0x7
#define _ANSELD_ANSELD7_SIZE                                0x1
#define _ANSELD_ANSELD7_LENGTH                              0x1
#define _ANSELD_ANSELD7_MASK                                0x80

// Register: IOCEF
#define IOCEF IOCEF
extern volatile unsigned char           IOCEF               __at(0xF27);
#ifndef _LIB_BUILD
asm("IOCEF equ 0F27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEF3                 :1;
    };
} IOCEFbits_t;
extern volatile IOCEFbits_t IOCEFbits __at(0xF27);
// bitfield macros
#define _IOCEF_IOCEF3_POSN                                  0x3
#define _IOCEF_IOCEF3_POSITION                              0x3
#define _IOCEF_IOCEF3_SIZE                                  0x1
#define _IOCEF_IOCEF3_LENGTH                                0x1
#define _IOCEF_IOCEF3_MASK                                  0x8

// Register: IOCEN
#define IOCEN IOCEN
extern volatile unsigned char           IOCEN               __at(0xF28);
#ifndef _LIB_BUILD
asm("IOCEN equ 0F28h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEN3                 :1;
    };
} IOCENbits_t;
extern volatile IOCENbits_t IOCENbits __at(0xF28);
// bitfield macros
#define _IOCEN_IOCEN3_POSN                                  0x3
#define _IOCEN_IOCEN3_POSITION                              0x3
#define _IOCEN_IOCEN3_SIZE                                  0x1
#define _IOCEN_IOCEN3_LENGTH                                0x1
#define _IOCEN_IOCEN3_MASK                                  0x8

// Register: IOCEP
#define IOCEP IOCEP
extern volatile unsigned char           IOCEP               __at(0xF29);
#ifndef _LIB_BUILD
asm("IOCEP equ 0F29h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEP3                 :1;
    };
} IOCEPbits_t;
