GopalSaraf/Practicals/PSDL/include/proc/pic18f46k40.h
// Register: ANSELE
#define ANSELE ANSELE
extern volatile unsigned char           ANSELE              __at(0xF2E);
#ifndef _LIB_BUILD
asm("ANSELE equ 0F2Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELE0                :1;
        unsigned ANSELE1                :1;
        unsigned ANSELE2                :1;
    };
} ANSELEbits_t;
extern volatile ANSELEbits_t ANSELEbits __at(0xF2E);
// bitfield macros
#define _ANSELE_ANSELE0_POSN                                0x0
#define _ANSELE_ANSELE0_POSITION                            0x0
#define _ANSELE_ANSELE0_SIZE                                0x1
#define _ANSELE_ANSELE0_LENGTH                              0x1
#define _ANSELE_ANSELE0_MASK                                0x1
#define _ANSELE_ANSELE1_POSN                                0x1
#define _ANSELE_ANSELE1_POSITION                            0x1
#define _ANSELE_ANSELE1_SIZE                                0x1
#define _ANSELE_ANSELE1_LENGTH                              0x1
#define _ANSELE_ANSELE1_MASK                                0x2
#define _ANSELE_ANSELE2_POSN                                0x2
#define _ANSELE_ANSELE2_POSITION                            0x2
#define _ANSELE_ANSELE2_SIZE                                0x1
#define _ANSELE_ANSELE2_LENGTH                              0x1
#define _ANSELE_ANSELE2_MASK                                0x4

// Register: HLVDCON0
#define HLVDCON0 HLVDCON0
extern volatile unsigned char           HLVDCON0            __at(0xF2F);
#ifndef _LIB_BUILD
asm("HLVDCON0 equ 0F2Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTL                   :1;
        unsigned INTH                   :1;
        unsigned                        :2;
        unsigned RDY                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned HLVDINTL               :1;
        unsigned HLVDINTH               :1;
        unsigned                        :2;
        unsigned HLVDRDY                :1;
        unsigned HLVDOUT                :1;
        unsigned                        :1;
        unsigned HLVDEN                 :1;
    };
} HLVDCON0bits_t;
extern volatile HLVDCON0bits_t HLVDCON0bits __at(0xF2F);
// bitfield macros
#define _HLVDCON0_INTL_POSN                                 0x0
#define _HLVDCON0_INTL_POSITION                             0x0
#define _HLVDCON0_INTL_SIZE                                 0x1
#define _HLVDCON0_INTL_LENGTH                               0x1
#define _HLVDCON0_INTL_MASK                                 0x1
#define _HLVDCON0_INTH_POSN                                 0x1
#define _HLVDCON0_INTH_POSITION                             0x1
#define _HLVDCON0_INTH_SIZE                                 0x1
#define _HLVDCON0_INTH_LENGTH                               0x1
#define _HLVDCON0_INTH_MASK                                 0x2
#define _HLVDCON0_RDY_POSN                                  0x4
#define _HLVDCON0_RDY_POSITION                              0x4
#define _HLVDCON0_RDY_SIZE                                  0x1
#define _HLVDCON0_RDY_LENGTH                                0x1
#define _HLVDCON0_RDY_MASK                                  0x10
#define _HLVDCON0_OUT_POSN                                  0x5
#define _HLVDCON0_OUT_POSITION                              0x5
#define _HLVDCON0_OUT_SIZE                                  0x1
#define _HLVDCON0_OUT_LENGTH                                0x1
#define _HLVDCON0_OUT_MASK                                  0x20
#define _HLVDCON0_EN_POSN                                   0x7
#define _HLVDCON0_EN_POSITION                               0x7
#define _HLVDCON0_EN_SIZE                                   0x1
#define _HLVDCON0_EN_LENGTH                                 0x1
#define _HLVDCON0_EN_MASK                                   0x80
#define _HLVDCON0_HLVDINTL_POSN                             0x0
#define _HLVDCON0_HLVDINTL_POSITION                         0x0
#define _HLVDCON0_HLVDINTL_SIZE                             0x1
#define _HLVDCON0_HLVDINTL_LENGTH                           0x1
#define _HLVDCON0_HLVDINTL_MASK                             0x1
#define _HLVDCON0_HLVDINTH_POSN                             0x1
#define _HLVDCON0_HLVDINTH_POSITION                         0x1
#define _HLVDCON0_HLVDINTH_SIZE                             0x1
#define _HLVDCON0_HLVDINTH_LENGTH                           0x1
#define _HLVDCON0_HLVDINTH_MASK                             0x2
#define _HLVDCON0_HLVDRDY_POSN                              0x4
#define _HLVDCON0_HLVDRDY_POSITION                          0x4
#define _HLVDCON0_HLVDRDY_SIZE                              0x1
#define _HLVDCON0_HLVDRDY_LENGTH                            0x1
#define _HLVDCON0_HLVDRDY_MASK                              0x10
#define _HLVDCON0_HLVDOUT_POSN                              0x5
#define _HLVDCON0_HLVDOUT_POSITION                          0x5
#define _HLVDCON0_HLVDOUT_SIZE                              0x1
#define _HLVDCON0_HLVDOUT_LENGTH                            0x1
#define _HLVDCON0_HLVDOUT_MASK                              0x20
#define _HLVDCON0_HLVDEN_POSN                               0x7
#define _HLVDCON0_HLVDEN_POSITION                           0x7
#define _HLVDCON0_HLVDEN_SIZE                               0x1
#define _HLVDCON0_HLVDEN_LENGTH                             0x1
#define _HLVDCON0_HLVDEN_MASK                               0x80

// Register: HLVDCON1
#define HLVDCON1 HLVDCON1
extern volatile unsigned char           HLVDCON1            __at(0xF30);
#ifndef _LIB_BUILD
asm("HLVDCON1 equ 0F30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEL                    :4;
    };
    struct {
        unsigned SEL0                   :1;
        unsigned SEL1                   :1;
        unsigned SEL2                   :1;
        unsigned SEL3                   :1;
    };
    struct {
        unsigned HLVDSEL0               :1;
        unsigned HLVDSEL1               :1;
        unsigned HLVDSEL2               :1;
        unsigned HLVDSEL3               :1;
    };
} HLVDCON1bits_t;
extern volatile HLVDCON1bits_t HLVDCON1bits __at(0xF30);
// bitfield macros
#define _HLVDCON1_SEL_POSN                                  0x0
#define _HLVDCON1_SEL_POSITION                              0x0
#define _HLVDCON1_SEL_SIZE                                  0x4
#define _HLVDCON1_SEL_LENGTH                                0x4
#define _HLVDCON1_SEL_MASK                                  0xF
#define _HLVDCON1_SEL0_POSN                                 0x0
#define _HLVDCON1_SEL0_POSITION                             0x0
#define _HLVDCON1_SEL0_SIZE                                 0x1
#define _HLVDCON1_SEL0_LENGTH                               0x1
#define _HLVDCON1_SEL0_MASK                                 0x1
#define _HLVDCON1_SEL1_POSN                                 0x1
#define _HLVDCON1_SEL1_POSITION                             0x1
#define _HLVDCON1_SEL1_SIZE                                 0x1
#define _HLVDCON1_SEL1_LENGTH                               0x1
#define _HLVDCON1_SEL1_MASK                                 0x2
#define _HLVDCON1_SEL2_POSN                                 0x2
#define _HLVDCON1_SEL2_POSITION                             0x2
#define _HLVDCON1_SEL2_SIZE                                 0x1
#define _HLVDCON1_SEL2_LENGTH                               0x1
#define _HLVDCON1_SEL2_MASK                                 0x4
#define _HLVDCON1_SEL3_POSN                                 0x3
#define _HLVDCON1_SEL3_POSITION                             0x3
#define _HLVDCON1_SEL3_SIZE                                 0x1
#define _HLVDCON1_SEL3_LENGTH                               0x1
#define _HLVDCON1_SEL3_MASK                                 0x8
#define _HLVDCON1_HLVDSEL0_POSN                             0x0
#define _HLVDCON1_HLVDSEL0_POSITION                         0x0
#define _HLVDCON1_HLVDSEL0_SIZE                             0x1
#define _HLVDCON1_HLVDSEL0_LENGTH                           0x1
#define _HLVDCON1_HLVDSEL0_MASK                             0x1
#define _HLVDCON1_HLVDSEL1_POSN                             0x1
#define _HLVDCON1_HLVDSEL1_POSITION                         0x1
#define _HLVDCON1_HLVDSEL1_SIZE                             0x1
#define _HLVDCON1_HLVDSEL1_LENGTH                           0x1
#define _HLVDCON1_HLVDSEL1_MASK                             0x2
#define _HLVDCON1_HLVDSEL2_POSN                             0x2
#define _HLVDCON1_HLVDSEL2_POSITION                         0x2
#define _HLVDCON1_HLVDSEL2_SIZE                             0x1
#define _HLVDCON1_HLVDSEL2_LENGTH                           0x1
#define _HLVDCON1_HLVDSEL2_MASK                             0x4
#define _HLVDCON1_HLVDSEL3_POSN                             0x3
#define _HLVDCON1_HLVDSEL3_POSITION                         0x3
#define _HLVDCON1_HLVDSEL3_SIZE                             0x1
#define _HLVDCON1_HLVDSEL3_LENGTH                           0x1
#define _HLVDCON1_HLVDSEL3_MASK                             0x8

// Register: FVRCON
#define FVRCON FVRCON
extern volatile unsigned char           FVRCON              __at(0xF31);
#ifndef _LIB_BUILD
asm("FVRCON equ 0F31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADFVR                  :2;
        unsigned CDAFVR                 :2;
        unsigned TSRNG                  :1;
        unsigned TSEN                   :1;
        unsigned RDY                    :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned ADFVR0                 :1;
        unsigned ADFVR1                 :1;
        unsigned CDAFVR0                :1;
        unsigned CDAFVR1                :1;
        unsigned                        :2;
        unsigned FVRRDY                 :1;
        unsigned FVREN                  :1;
    };
} FVRCONbits_t;
extern volatile FVRCONbits_t FVRCONbits __at(0xF31);
// bitfield macros
#define _FVRCON_ADFVR_POSN                                  0x0
#define _FVRCON_ADFVR_POSITION                              0x0
#define _FVRCON_ADFVR_SIZE                                  0x2
#define _FVRCON_ADFVR_LENGTH                                0x2
#define _FVRCON_ADFVR_MASK                                  0x3
#define _FVRCON_CDAFVR_POSN                                 0x2
#define _FVRCON_CDAFVR_POSITION                             0x2
#define _FVRCON_CDAFVR_SIZE                                 0x2
#define _FVRCON_CDAFVR_LENGTH                               0x2
#define _FVRCON_CDAFVR_MASK                                 0xC
#define _FVRCON_TSRNG_POSN                                  0x4
#define _FVRCON_TSRNG_POSITION                              0x4
#define _FVRCON_TSRNG_SIZE                                  0x1
#define _FVRCON_TSRNG_LENGTH                                0x1
#define _FVRCON_TSRNG_MASK                                  0x10
#define _FVRCON_TSEN_POSN                                   0x5
#define _FVRCON_TSEN_POSITION                               0x5
#define _FVRCON_TSEN_SIZE                                   0x1
#define _FVRCON_TSEN_LENGTH                                 0x1
#define _FVRCON_TSEN_MASK                                   0x20
#define _FVRCON_RDY_POSN                                    0x6
#define _FVRCON_RDY_POSITION                                0x6
#define _FVRCON_RDY_SIZE                                    0x1
#define _FVRCON_RDY_LENGTH                                  0x1
#define _FVRCON_RDY_MASK                                    0x40
#define _FVRCON_EN_POSN                                     0x7
#define _FVRCON_EN_POSITION                                 0x7
#define _FVRCON_EN_SIZE                                     0x1
#define _FVRCON_EN_LENGTH                                   0x1
#define _FVRCON_EN_MASK                                     0x80
#define _FVRCON_ADFVR0_POSN                                 0x0
#define _FVRCON_ADFVR0_POSITION                             0x0
#define _FVRCON_ADFVR0_SIZE                                 0x1
#define _FVRCON_ADFVR0_LENGTH                               0x1
#define _FVRCON_ADFVR0_MASK                                 0x1
#define _FVRCON_ADFVR1_POSN                                 0x1
#define _FVRCON_ADFVR1_POSITION                             0x1
#define _FVRCON_ADFVR1_SIZE                                 0x1
#define _FVRCON_ADFVR1_LENGTH                               0x1
#define _FVRCON_ADFVR1_MASK                                 0x2
#define _FVRCON_CDAFVR0_POSN                                0x2
#define _FVRCON_CDAFVR0_POSITION                            0x2
#define _FVRCON_CDAFVR0_SIZE                                0x1
#define _FVRCON_CDAFVR0_LENGTH                              0x1
#define _FVRCON_CDAFVR0_MASK                                0x4
#define _FVRCON_CDAFVR1_POSN                                0x3
#define _FVRCON_CDAFVR1_POSITION                            0x3
#define _FVRCON_CDAFVR1_SIZE                                0x1
#define _FVRCON_CDAFVR1_LENGTH                              0x1
#define _FVRCON_CDAFVR1_MASK                                0x8
#define _FVRCON_FVRRDY_POSN                                 0x6
#define _FVRCON_FVRRDY_POSITION                             0x6
#define _FVRCON_FVRRDY_SIZE                                 0x1
#define _FVRCON_FVRRDY_LENGTH                               0x1
#define _FVRCON_FVRRDY_MASK                                 0x40
#define _FVRCON_FVREN_POSN                                  0x7
#define _FVRCON_FVREN_POSITION                              0x7
#define _FVRCON_FVREN_SIZE                                  0x1
#define _FVRCON_FVREN_LENGTH                                0x1
#define _FVRCON_FVREN_MASK                                  0x80

// Register: ZCDCON
#define ZCDCON ZCDCON
extern volatile unsigned char           ZCDCON              __at(0xF32);
#ifndef _LIB_BUILD
asm("ZCDCON equ 0F32h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned                        :2;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned SEN                    :1;
    };
    struct {
        unsigned ZCDINTN                :1;
        unsigned ZCDINTP                :1;
        unsigned                        :2;
        unsigned ZCDPOL                 :1;
        unsigned ZCDOUT                 :1;
        unsigned                        :1;
        unsigned ZCDSEN                 :1;
    };
} ZCDCONbits_t;
extern volatile ZCDCONbits_t ZCDCONbits __at(0xF32);
// bitfield macros
#define _ZCDCON_INTN_POSN                                   0x0
#define _ZCDCON_INTN_POSITION                               0x0
#define _ZCDCON_INTN_SIZE                                   0x1
#define _ZCDCON_INTN_LENGTH                                 0x1
#define _ZCDCON_INTN_MASK                                   0x1
#define _ZCDCON_INTP_POSN                                   0x1
#define _ZCDCON_INTP_POSITION                               0x1
#define _ZCDCON_INTP_SIZE                                   0x1
#define _ZCDCON_INTP_LENGTH                                 0x1
#define _ZCDCON_INTP_MASK                                   0x2
#define _ZCDCON_POL_POSN                                    0x4
#define _ZCDCON_POL_POSITION                                0x4
#define _ZCDCON_POL_SIZE                                    0x1
#define _ZCDCON_POL_LENGTH                                  0x1
#define _ZCDCON_POL_MASK                                    0x10
#define _ZCDCON_OUT_POSN                                    0x5
#define _ZCDCON_OUT_POSITION                                0x5
#define _ZCDCON_OUT_SIZE                                    0x1
#define _ZCDCON_OUT_LENGTH                                  0x1
#define _ZCDCON_OUT_MASK                                    0x20
#define _ZCDCON_SEN_POSN                                    0x7
#define _ZCDCON_SEN_POSITION                                0x7
#define _ZCDCON_SEN_SIZE                                    0x1
#define _ZCDCON_SEN_LENGTH                                  0x1
#define _ZCDCON_SEN_MASK                                    0x80
#define _ZCDCON_ZCDINTN_POSN                                0x0
#define _ZCDCON_ZCDINTN_POSITION                            0x0
#define _ZCDCON_ZCDINTN_SIZE                                0x1
#define _ZCDCON_ZCDINTN_LENGTH                              0x1
#define _ZCDCON_ZCDINTN_MASK                                0x1
#define _ZCDCON_ZCDINTP_POSN                                0x1
#define _ZCDCON_ZCDINTP_POSITION                            0x1
#define _ZCDCON_ZCDINTP_SIZE                                0x1
#define _ZCDCON_ZCDINTP_LENGTH                              0x1
#define _ZCDCON_ZCDINTP_MASK                                0x2
#define _ZCDCON_ZCDPOL_POSN                                 0x4
#define _ZCDCON_ZCDPOL_POSITION                             0x4
#define _ZCDCON_ZCDPOL_SIZE                                 0x1
#define _ZCDCON_ZCDPOL_LENGTH                               0x1
#define _ZCDCON_ZCDPOL_MASK                                 0x10
#define _ZCDCON_ZCDOUT_POSN                                 0x5
#define _ZCDCON_ZCDOUT_POSITION                             0x5
#define _ZCDCON_ZCDOUT_SIZE                                 0x1
#define _ZCDCON_ZCDOUT_LENGTH                               0x1
#define _ZCDCON_ZCDOUT_MASK                                 0x20
#define _ZCDCON_ZCDSEN_POSN                                 0x7
#define _ZCDCON_ZCDSEN_POSITION                             0x7
#define _ZCDCON_ZCDSEN_SIZE                                 0x1
#define _ZCDCON_ZCDSEN_LENGTH                               0x1
#define _ZCDCON_ZCDSEN_MASK                                 0x80

// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
extern volatile unsigned char           DAC1CON0            __at(0xF33);
#ifndef _LIB_BUILD
asm("DAC1CON0 equ 0F33h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :1;
        unsigned                        :1;
        unsigned PSS                    :2;
        unsigned OE2                    :1;
        unsigned OE1                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned DAC1NSS                :1;
        unsigned                        :1;
        unsigned DAC1PSS0               :1;
        unsigned DAC1PSS1               :1;
        unsigned DAC1OE2                :1;
        unsigned DAC1OE1                :1;
        unsigned                        :1;
        unsigned DAC1EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
    };
} DAC1CON0bits_t;
extern volatile DAC1CON0bits_t DAC1CON0bits __at(0xF33);
// bitfield macros
#define _DAC1CON0_NSS_POSN                                  0x0
#define _DAC1CON0_NSS_POSITION                              0x0
#define _DAC1CON0_NSS_SIZE                                  0x1
#define _DAC1CON0_NSS_LENGTH                                0x1
#define _DAC1CON0_NSS_MASK                                  0x1
#define _DAC1CON0_PSS_POSN                                  0x2
#define _DAC1CON0_PSS_POSITION                              0x2
#define _DAC1CON0_PSS_SIZE                                  0x2
#define _DAC1CON0_PSS_LENGTH                                0x2
#define _DAC1CON0_PSS_MASK                                  0xC
#define _DAC1CON0_OE2_POSN                                  0x4
#define _DAC1CON0_OE2_POSITION                              0x4
#define _DAC1CON0_OE2_SIZE                                  0x1
#define _DAC1CON0_OE2_LENGTH                                0x1
#define _DAC1CON0_OE2_MASK                                  0x10
#define _DAC1CON0_OE1_POSN                                  0x5
#define _DAC1CON0_OE1_POSITION                              0x5
#define _DAC1CON0_OE1_SIZE                                  0x1
#define _DAC1CON0_OE1_LENGTH                                0x1
#define _DAC1CON0_OE1_MASK                                  0x20
#define _DAC1CON0_EN_POSN                                   0x7
#define _DAC1CON0_EN_POSITION                               0x7
#define _DAC1CON0_EN_SIZE                                   0x1
#define _DAC1CON0_EN_LENGTH                                 0x1
#define _DAC1CON0_EN_MASK                                   0x80
#define _DAC1CON0_DAC1NSS_POSN                              0x0
#define _DAC1CON0_DAC1NSS_POSITION                          0x0
#define _DAC1CON0_DAC1NSS_SIZE                              0x1
#define _DAC1CON0_DAC1NSS_LENGTH                            0x1
#define _DAC1CON0_DAC1NSS_MASK                              0x1
#define _DAC1CON0_DAC1PSS0_POSN                             0x2
#define _DAC1CON0_DAC1PSS0_POSITION                         0x2
#define _DAC1CON0_DAC1PSS0_SIZE                             0x1
#define _DAC1CON0_DAC1PSS0_LENGTH                           0x1
#define _DAC1CON0_DAC1PSS0_MASK                             0x4
#define _DAC1CON0_DAC1PSS1_POSN                             0x3
#define _DAC1CON0_DAC1PSS1_POSITION                         0x3
#define _DAC1CON0_DAC1PSS1_SIZE                             0x1
#define _DAC1CON0_DAC1PSS1_LENGTH                           0x1
#define _DAC1CON0_DAC1PSS1_MASK                             0x8
#define _DAC1CON0_DAC1OE2_POSN                              0x4
#define _DAC1CON0_DAC1OE2_POSITION                          0x4
#define _DAC1CON0_DAC1OE2_SIZE                              0x1
#define _DAC1CON0_DAC1OE2_LENGTH                            0x1
#define _DAC1CON0_DAC1OE2_MASK                              0x10
#define _DAC1CON0_DAC1OE1_POSN                              0x5
#define _DAC1CON0_DAC1OE1_POSITION                          0x5
#define _DAC1CON0_DAC1OE1_SIZE                              0x1
#define _DAC1CON0_DAC1OE1_LENGTH                            0x1
#define _DAC1CON0_DAC1OE1_MASK                              0x20
#define _DAC1CON0_DAC1EN_POSN                               0x7
#define _DAC1CON0_DAC1EN_POSITION                           0x7
#define _DAC1CON0_DAC1EN_SIZE                               0x1
#define _DAC1CON0_DAC1EN_LENGTH                             0x1
#define _DAC1CON0_DAC1EN_MASK                               0x80
#define _DAC1CON0_PSS0_POSN                                 0x2
#define _DAC1CON0_PSS0_POSITION                             0x2
#define _DAC1CON0_PSS0_SIZE                                 0x1
#define _DAC1CON0_PSS0_LENGTH                               0x1
#define _DAC1CON0_PSS0_MASK                                 0x4
#define _DAC1CON0_PSS1_POSN                                 0x3
#define _DAC1CON0_PSS1_POSITION                             0x3
#define _DAC1CON0_PSS1_SIZE                                 0x1
#define _DAC1CON0_PSS1_LENGTH                               0x1
#define _DAC1CON0_PSS1_MASK                                 0x8

// Register: DAC1CON1
#define DAC1CON1 DAC1CON1
extern volatile unsigned char           DAC1CON1            __at(0xF34);
#ifndef _LIB_BUILD
asm("DAC1CON1 equ 0F34h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC1R                  :5;
    };
    struct {
        unsigned DAC1R0                 :1;
        unsigned DAC1R1                 :1;
        unsigned DAC1R2                 :1;
        unsigned DAC1R3                 :1;
        unsigned DAC1R4                 :1;
    };
} DAC1CON1bits_t;
